app/controllers/posts_controller.rb

  def index
    respond_with Post.all
---
SELECT  "posts".* FROM "posts"   ORDER BY "posts"."id" ASC LIMIT 1

  def create
    respond_with Post.create!(post_params)
---
INSERT INTO "posts" ("author", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "test"], ["body", "あああああ"], ["created_at", "2016-07-12 02:57:10.355057"], ["updated_at", "2016-07-12 02:57:10.355057"]]